Common/target/cipher/Test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.pos.qhic.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:doPosRequest>
         <!--Optional:-->
         <arg0><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
<RequestMessage><MessageContent><requsetUser>jlPos</requsetUser><userPsw>qhicJl</userPsw><transCode>1001</transCode><reqTime>20160309114027</reqTime><serialNumber>g4UKRwFHT06G42Yi20160309114027</serialNumber><Message><merchantId>123456QHIC</merchantId><compCode>QHIC</compCode><terminalId>VIH00010101</terminalId><orderId>R2016000000000140817</orderId></Message></MessageContent><MAC>krQRGuFMZn9G8TJuS2kFPUYGH3zd5gpC0bYQWiUa749uLAtn0MjQYjvWb5w5SG9MyZa8iwFGmqga
4F+tIxPzsdtNfL+LB4A4EMs2aqwU5TbNS2L7yF+Pba0WMd2x5EL9lyvD9aeTw27/fUb32xUSsqYC
27G7GCCMOxH55z6RuH2csaik/4mXlZAlnRWbM9voxmXTdVLgK0IMLIgI6G1P5AP1rceMmuKwnfVY
ti4loeZ28MIzCxC9AAjpVMurVTKILkoUWGviPBUZP/Pik05N3p0JOlLYrHHhRrSyn0Rtc01qmETY
qbOCfv2xFI2Un+ByqyTUSzZlZpaqMHh6mkkSSw==</MAC></RequestMessage>]]></arg0>
      </ser:doPosRequest>
   </soapenv:Body>
</soapenv:Envelope>